app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'gabriella89'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        if ($this->request->getPost()) {
            $rules = [
                'username' => 'required|min_length[6]',
                'password' => 'required|min_length[7]|numeric',
            ];

            date_default_timezone_set('Asia/Jakarta');
            $waktuLogin = date('Y/m/d h:i:s');

            if ($this->validate($rules)) {
                $username = $this->request->getVar('username');
                $password = $this->request->getVar('password');

                $dataUser = $this->user->where(['username' => $username])->first(); //pasw 1234567